In [626]:
import warnings
warnings.filterwarnings("ignore")

In [627]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [628]:
calls = pd.read_csv('datasets/megaline_calls.csv')

In [629]:
messages = pd.read_csv('datasets/megaline_messages.csv')

In [630]:
internet = pd.read_csv('datasets/megaline_internet.csv')

In [631]:
users = pd.read_csv('datasets/megaline_users1.csv')

In [632]:
plans = pd.read_csv('datasets/megaline_plans.csv')

In [633]:
calls.head()

         id  user_id   call_date  duration
0   1000_93     1000  2018-12-27      8.52
1  1000_145     1000  2018-12-27     13.66
2  1000_247     1000  2018-12-27     14.48
3  1000_309     1000  2018-12-28      5.76
4  1000_380     1000  2018-12-30      4.22

In [634]:
calls.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 137735 entries, 0 to 137734
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   id         137735 non-null  object
 1   user_id    137735 non-null  int64
 2   call_date  137735 non-null  object
 3   duration   137735 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 4.2+ MB

In [635]:
messages.head()

         id  user_id message_date
0  1000_125     1000   2018-12-27
1  1000_160     1000   2018-12-31
2  1000_223     1000   2018-12-31
3  1000_251     1000   2018-12-27
4  1000_255     1000   2018-12-26

In [636]:
messages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76051 entries, 0 to 76050
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            76051 non-null  object
 1   user_id       76051 non-null  int64
 2   message_date  76051 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.7+ MB

In [637]:
internet.head()

         id  user_id session_date  mb_used
0   1000_13     1000   2018-12-29    89.86
1  1000_204     1000   2018-12-31     0.00
2  1000_379     1000   2018-12-28   660.40
3  1000_413     1000   2018-12-26   270.99
4  1000_442     1000   2018-12-27   880.22

In [638]:
internet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104825 entries, 0 to 104824
Data columns (total 4 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   id            104825 non-null  object
 1   user_id       104825 non-null  int64
 2   session_date  104825 non-null  object
 3   mb_used       104825 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 3.2+ MB

In [639]:
users.head()

,user_id,first_name,last_name,age,city,reg_date,plan,churn_date
0,1000,Anamaria,Bauer,45,"Atlanta-Sandy Springs-Roswell, GA MSA",2018-12-24,ultimate,NaN
1,1001,Mickey,Wilkerson,28,"Seattle-Tacoma-Bellevue, WA MSA",2018-08-13,surf,NaN
2,1002,Carlee,Hoffman,36,"Las Vegas-Henderson-Paradise, NV MSA",2018-10-21,surf,NaN
3,1003,Reynaldo,Jenkins,52,"Tulsa, OK MSA",2018-01-28,surf,NaN
4,1004,Leonila,Thompson,40,"Seattle-Tacoma-Bellevue, WA MSA",2018-05-23,surf,NaN

In [640]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     500 non-null    int64
 1   first_name  500 non-null    object
 2   last_name   500 non-null    object
 3   age         500 non-null    int64
 4   city        500 non-null    object
 5   reg_date    500 non-null    object
 6   plan        500 non-null    object
 7   churn_date  34 non-null     object
dtypes: int64(2), object(6)
memory usage: 31.4+ KB

In [641]:
users['reg_date'] = pd.to_datetime(users['reg_date'], format='%Y-%m-%d')

In [642]:
#users['churn_date'].fillna(value='2019-01-01', inplace=True)

In [643]:
users['churn_date'] = pd.to_datetime(users['churn_date'], format='%Y-%m-%d')

In [644]:
plans.head()

,messages_included,mb_per_month_included,minutes_included,usd_monthly_pay,usd_per_gb,usd_per_message,usd_per_minute,plan_name
0,50,15360,500,20,10,0.03,0.03,surf
1,1000,30720,3000,70,7,0.01,0.01,ultimate

### Create a report

In [645]:
users['reg_month'] = users['reg_date'].values.astype('datetime64[M]')
#create a reg_month column

In [646]:
users['churn_month'] = users['churn_date'].values.astype('datetime64[M]')

In [647]:
min_month = users['reg_date'].values.astype('datetime64[M]').min()
#minimum month

In [648]:
max_month = users['reg_date'].values.astype('datetime64[M]').max()
#maximum month

In [649]:
(min_month, max_month)
#range of minimum and maximum

(numpy.datetime64('2018-01'), numpy.datetime64('2018-12'))

In [650]:
months = pd.DataFrame(pd.date_range(min_month, max_month, freq='MS'))
#create a dataframe of the months

In [651]:
months

            0
0  2018-01-01
1  2018-02-01
2  2018-03-01
3  2018-04-01
4  2018-05-01
5  2018-06-01
6  2018-07-01
7  2018-08-01
8  2018-09-01
9  2018-10-01
10 2018-11-01
11 2018-12-01

In [652]:
months.columns = ['month'] #rename the month column

In [653]:
len(users)*len(months) #check length of merging each user with each month

6000

In [654]:
users['key'] = 1
months['key'] = 1
#create a uniform key to merge the 2df on

In [655]:
report = months.merge(users, on='key')
#the merge

In [656]:
users[users['churn_date'].notna()].head()

,user_id,first_name,last_name,age,city,reg_date,plan,churn_date,reg_month,churn_month,key
6,1006,Jesusa,Bradford,73,"San Francisco-Oakland-Berkeley, CA MSA",2018-11-27,ultimate,2018-12-18,2018-11-01,2018-12-01,1
12,1012,Jonelle,Mcbride,59,"Chicago-Naperville-Elgin, IL-IN-WI MSA",2018-06-28,surf,2018-11-16,2018-06-01,2018-11-01,1
22,1022,Bo,Snow,73,"New York-Newark-Jersey City, NY-NJ-PA MSA",2018-04-20,surf,2018-09-07,2018-04-01,2018-09-01,1
40,1040,Paris,Santos,72,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD MSA",2018-12-23,surf,2018-12-30,2018-12-01,2018-12-01,1
50,1050,Jone,Owen,23,"Miami-Fort Lauderdale-West Palm Beach, FL MSA",2018-03-20,ultimate,2018-10-07,2018-03-01,2018-10-01,1

In [657]:
users.head()

,user_id,first_name,last_name,age,city,reg_date,plan,churn_date,reg_month,churn_month,key
0,1000,Anamaria,Bauer,45,"Atlanta-Sandy Springs-Roswell, GA MSA",2018-12-24,ultimate,NaT,2018-12-01,NaT,1
1,1001,Mickey,Wilkerson,28,"Seattle-Tacoma-Bellevue, WA MSA",2018-08-13,surf,NaT,2018-08-01,NaT,1
2,1002,Carlee,Hoffman,36,"Las Vegas-Henderson-Paradise, NV MSA",2018-10-21,surf,NaT,2018-10-01,NaT,1
3,1003,Reynaldo,Jenkins,52,"Tulsa, OK MSA",2018-01-28,surf,NaT,2018-01-01,NaT,1
4,1004,Leonila,Thompson,40,"Seattle-Tacoma-Bellevue, WA MSA",2018-05-23,surf,NaT,2018-05-01,NaT,1

In [658]:
report.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6000 entries, 0 to 5999
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   month        6000 non-null   datetime64[ns]
 1   key          6000 non-null   int64
 2   user_id      6000 non-null   int64
 3   first_name   6000 non-null   object
 4   last_name    6000 non-null   object
 5   age          6000 non-null   int64
 6   city         6000 non-null   object
 7   reg_date     6000 non-null   datetime64[ns]
 8   plan         6000 non-null   object
 9   churn_date   408 non-null    datetime64[ns]
 10  reg_month    6000 non-null   datetime64[ns]
 11  churn_month  408 non-null    datetime64[ns]
dtypes: datetime64[ns](5), int64(3), object(4)
memory usage: 609.4+ KB

In [659]:
len(report[report['month']>=report['reg_month']]) #some users came after the minimal date

3355

In [660]:
#some users left before the maximum date
len(report[report['month'] <= report['churn_month']])

366

In [661]:
report = report[report['month'] >= report['reg_month']] 
# select month for user after registration

In [662]:
#report = report[report['month'] <= report['churn_month']]

In [663]:
report.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3355 entries, 3 to 5999
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   month        3355 non-null   datetime64[ns]
 1   key          3355 non-null   int64
 2   user_id      3355 non-null   int64
 3   first_name   3355 non-null   object
 4   last_name    3355 non-null   object
 5   age          3355 non-null   int64
 6   city         3355 non-null   object
 7   reg_date     3355 non-null   datetime64[ns]
 8   plan         3355 non-null   object
 9   churn_date   234 non-null    datetime64[ns]
 10  reg_month    3355 non-null   datetime64[ns]
 11  churn_month  234 non-null    datetime64[ns]
dtypes: datetime64[ns](5), int64(3), object(4)
memory usage: 340.7+ KB

In [664]:
report = report[['month', 'key', 'user_id', 'city', 'plan', 'reg_month']] #select only wanted columns

In [665]:
#specific user
report[report['user_id'] == 1000]

,month,key,user_id,city,plan,reg_month
5500,2018-12-01,1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,2018-12-01

In [666]:
report[report['user_id'] == 1003]

          month  key  user_id           city  plan  reg_month
3    2018-01-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
503  2018-02-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
1003 2018-03-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
1503 2018-04-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
2003 2018-05-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
2503 2018-06-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
3003 2018-07-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
3503 2018-08-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
4003 2018-09-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
4503 2018-10-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
5003 2018-11-01    1     1003  Tulsa, OK MSA  surf 2018-01-01
5503 2018-12-01    1     1003  Tulsa, OK MSA  surf 2018-01-01

### Calls

In [667]:
data = users[['user_id', 'city', 'plan']]
#take specific columns from users

In [668]:
data_calls = data.merge(calls, how='outer', on='user_id')
#merge on data with calls by the outer

In [669]:
data_calls.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 137754 entries, 0 to 137753
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   user_id    137754 non-null  int64
 1   city       137754 non-null  object
 2   plan       137754 non-null  object
 3   id         137735 non-null  object
 4   call_date  137735 non-null  object
 5   duration   137735 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 7.4+ MB

In [670]:
data_calls.head()

,user_id,city,plan,id,call_date,duration
0,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_93,2018-12-27,8.52
1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_145,2018-12-27,13.66
2,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_247,2018-12-27,14.48
3,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_309,2018-12-28,5.76
4,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_380,2018-12-30,4.22

In [671]:
data_calls['call_date'] = pd.to_datetime(data_calls['call_date'], format='%Y-%m-%d')

In [672]:
data_calls['month'] = data_calls['call_date'].values.astype('datetime64[M]')
#create a month column of datetime

In [673]:
calls_month = data_calls.groupby(['user_id', 'month'])[['duration']].agg(['sum']).reset_index()
#create a groupby which has the sum of call duration for each user in each month

In [674]:
calls_month.sample(10)

     user_id      month duration
                             sum
1870    1406 2018-10-01   430.75
896     1191 2018-09-01   415.08
715     1155 2018-04-01   276.18
1822    1400 2018-03-01   322.05
544     1117 2018-09-01   476.74
951     1203 2018-06-01   448.16
1321    1291 2018-07-01   611.52
213     1050 2018-12-01   275.76
1409    1313 2018-10-01   531.45
1427    1318 2018-10-01   385.58

In [675]:
calls_month.columns = ['user_id', 'month', 'total_duration'] # maybe round up the duration at this point

In [676]:
#round up the minutes to the nearest whole number
calls_month['total_duration'] = calls_month['total_duration'].round(0)

In [677]:
user_plan = users[['user_id', 'plan']]
#select each user and there plan to be the dictionary values for merging

In [678]:
user_plan[user_plan['user_id'] == 1233] #testing

     user_id  plan
233     1233  surf

In [679]:
calls_month = calls_month.merge(user_plan, on='user_id', how='left')
#merge to find each users plan, in each month.

In [680]:
plans
#look at plans

,messages_included,mb_per_month_included,minutes_included,usd_monthly_pay,usd_per_gb,usd_per_message,usd_per_minute,plan_name
0,50,15360,500,20,10,0.03,0.03,surf
1,1000,30720,3000,70,7,0.01,0.01,ultimate

In [681]:
call_plan = plans[['plan_name', 'minutes_included']]
#a df for minutes included in each plan

In [682]:
call_plan.columns = ['plan', 'plan_minutes']
#change the column names

In [683]:
call_plan
#check

       plan  plan_minutes
0      surf           500
1  ultimate          3000

In [684]:
calls_month = calls_month.merge(call_plan, on='plan', how='left')
#merge each user with their minutes included for their plan, in each month

In [685]:
calls_month['extra_mins'] = calls_month['total_duration'] - calls_month['plan_minutes']
#calculate the extra minutes used every month according tomplan package

In [686]:
#calls_month['extra_mins'] = calls_month['extra_mins'].round(0) #round up the minutes

In [687]:
#change mins to integer
#calls_month['extra_mins'] = calls_month['extra_mins'].astype(np.int64)

In [688]:
#a function to change the -ve values to zero
def count_calc(extra):
    if extra < 0:
        return 0
    if extra == 0:
        return 0
    if extra > 0:
        return extra

In [689]:
calls_month['extra_duration'] = calls_month['extra_mins'].apply(count_calc)
#apply the function to the column

In [690]:
extraminute_plan = plans[['plan_name', 'usd_per_minute']]
# a df to use as key for extra mins in each plan

In [691]:
extraminute_plan.columns = ['plan', 'usd_per_minute']
#change the columns

In [692]:
calls_month = calls_month.merge(extraminute_plan, on='plan', how='left')
#merge each extra minute cost to the calls

In [693]:
calls_month['call_cost'] = calls_month['extra_duration'] * calls_month['usd_per_minute']
#create a cost column of extra mintes used

In [694]:
calls_month = calls_month[['user_id', 'month', 'call_cost']]
#select required columns

In [695]:
report = report.merge(calls_month, on=['user_id', 'month'], how='left')
#merge with the report

In [696]:
report.shape

(3355, 7)

In [697]:
calls_month.shape

(2258, 3)

In [698]:
report.head()
#NaN are for users who did not make calls that month
#0.0 are for users who had no extra cost

,month,key,user_id,city,plan,reg_month,call_cost
0,2018-01-01,1,1003,"Tulsa, OK MSA",surf,2018-01-01,NaN
1,2018-01-01,1,1011,"Cleveland-Elyria, OH MSA",ultimate,2018-01-01,NaN
2,2018-01-01,1,1019,"Jacksonville, FL MSA",surf,2018-01-01,NaN
3,2018-01-01,1,1029,"Tampa-St. Petersburg-Clearwater, FL MSA",surf,2018-01-01,NaN
4,2018-01-01,1,1042,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD MSA",surf,2018-01-01,0.0

### Messages

In [699]:
data.head()

   user_id                                   city      plan
0     1000  Atlanta-Sandy Springs-Roswell, GA MSA  ultimate
1     1001        Seattle-Tacoma-Bellevue, WA MSA      surf
2     1002   Las Vegas-Henderson-Paradise, NV MSA      surf
3     1003                          Tulsa, OK MSA      surf
4     1004        Seattle-Tacoma-Bellevue, WA MSA      surf

In [700]:
messages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76051 entries, 0 to 76050
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            76051 non-null  object
 1   user_id       76051 non-null  int64
 2   message_date  76051 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.7+ MB

In [701]:
data_messages = data.merge(messages, on='user_id', how='right')

In [702]:
data_messages['message_date'] = pd.to_datetime(data_messages['message_date'], format='%Y-%m-%d')

In [703]:
data_messages['id'].duplicated().sum()
#all messages are unique, so they each get a count of 1.

0

In [704]:
data_messages['msg_count'] = 1

In [705]:
data_messages.head()

,user_id,city,plan,id,message_date,msg_count
0,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_125,2018-12-27,1
1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_160,2018-12-31,1
2,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_223,2018-12-31,1
3,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_251,2018-12-27,1
4,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_255,2018-12-26,1

In [706]:
data_messages['month'] = data_messages['message_date'].values.astype('datetime64[M]')

In [707]:
msg_month = data_messages.groupby(['user_id', 'month'])[['msg_count']].agg(['sum']).reset_index()

In [708]:
msg_month.sample(10)

     user_id      month msg_count
                              sum
11      1004 2018-06-01        18
743     1198 2018-09-01         7
363     1101 2018-08-01       106
1612    1440 2018-09-01        43
527     1141 2018-11-01        15
1736    1474 2018-10-01        35
1261    1339 2018-09-01        90
235     1069 2018-12-01        98
1027    1268 2018-03-01        10
1799    1494 2018-12-01        33

In [709]:
msg_month.columns = ['user_id', 'month', 'total_msg']

In [710]:
msg_month = msg_month.merge(user_plan, on='user_id', how='left')

In [711]:
msg_plan = plans[['plan_name', 'messages_included']]
msg_plan.columns = ['plan', 'plan_messages']

In [712]:
msg_plan

       plan  plan_messages
0      surf             50
1  ultimate           1000

In [713]:
msg_month = msg_month.merge(msg_plan, on='plan', how='left')

In [714]:
msg_month['xtra_msg'] = msg_month['total_msg'] - msg_month['plan_messages']

In [715]:
msg_month['xtra_txt'] = msg_month['xtra_msg'].apply(count_calc)

In [716]:
extramsg_plan = plans[['plan_name', 'usd_per_message']]

In [717]:
extramsg_plan.columns = ['plan', 'usd_per_message']

In [718]:
msg_month = msg_month.merge(extramsg_plan, on='plan', how='left')

In [719]:
msg_month['msg_cost'] = msg_month['xtra_txt'] * msg_month['usd_per_message']

In [720]:
msg_month = msg_month[['user_id', 'month', 'msg_cost']]

In [721]:
report.head()

,month,key,user_id,city,plan,reg_month,call_cost
0,2018-01-01,1,1003,"Tulsa, OK MSA",surf,2018-01-01,NaN
1,2018-01-01,1,1011,"Cleveland-Elyria, OH MSA",ultimate,2018-01-01,NaN
2,2018-01-01,1,1019,"Jacksonville, FL MSA",surf,2018-01-01,NaN
3,2018-01-01,1,1029,"Tampa-St. Petersburg-Clearwater, FL MSA",surf,2018-01-01,NaN
4,2018-01-01,1,1042,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD MSA",surf,2018-01-01,0.0

In [722]:
report.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3355 entries, 0 to 3354
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   month      3355 non-null   datetime64[ns]
 1   key        3355 non-null   int64
 2   user_id    3355 non-null   int64
 3   city       3355 non-null   object
 4   plan       3355 non-null   object
 5   reg_month  3355 non-null   datetime64[ns]
 6   call_cost  2258 non-null   float64
dtypes: datetime64[ns](2), float64(1), int64(2), object(2)
memory usage: 209.7+ KB

In [723]:
report = report.merge(msg_month, on=['user_id', 'month'], how='left')

In [724]:
report.shape[0]

3355

### Internet

In [725]:
#convert to GB

In [726]:
data_internet = data.merge(internet, how='right', on='user_id')

In [727]:
data_internet.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 104825 entries, 0 to 104824
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       104825 non-null  int64
 1   city          104825 non-null  object
 2   plan          104825 non-null  object
 3   id            104825 non-null  object
 4   session_date  104825 non-null  object
 5   mb_used       104825 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 5.6+ MB

In [728]:
data_internet['session_date'] = pd.to_datetime(data_internet['session_date'], format='%Y-%m-%d')

In [729]:
data_internet['id'].duplicated().sum()

0

In [730]:
data_internet.head()

,user_id,city,plan,id,session_date,mb_used
0,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_13,2018-12-29,89.86
1,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_204,2018-12-31,0.00
2,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_379,2018-12-28,660.40
3,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_413,2018-12-26,270.99
4,1000,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,1000_442,2018-12-27,880.22

In [731]:
data_internet['month'] = data_internet['session_date'].values.astype('datetime64[M]')

In [732]:
mb_month = data_internet.groupby(['user_id', 'month'])[['mb_used']].agg(['sum']).reset_index()
mb_month.columns = ['user_id', 'month', 'total_mb']

In [733]:
mb_month.head()

   user_id      month  total_mb
0     1000 2018-12-01   1901.47
1     1001 2018-08-01   6919.15
2     1001 2018-09-01  13314.82
3     1001 2018-10-01  22330.49
4     1001 2018-11-01  18504.30

In [734]:
mb_month = mb_month.merge(user_plan, on='user_id', how='left')

In [735]:
mb_plan = plans[['plan_name', 'mb_per_month_included']]
mb_plan.columns = ['plan', 'plan_mb']

In [736]:
mb_month = mb_month.merge(mb_plan, on='plan', how='left')

In [737]:
mb_month['extra_mb'] = mb_month['total_mb'] - mb_month['plan_mb']

In [738]:
mb_month['extra_mb'] = mb_month['extra_mb'].apply(count_calc)

In [739]:
def mb_gb_converter(mb):
    if mb == 0:
        return 0
    if mb > 0:
        return mb/1024

In [740]:
mb_month['extra_gb'] = mb_month['extra_mb'].apply(mb_gb_converter)

In [741]:
#write a function the checks decimal place values and performs an action

In [742]:
mb_month['extra_gb'] = mb_month['extra_gb'].round(0)

In [743]:
x = np.round([0.28, 0.50, 0.64, 0.09, 4.59, 3.28], decimals=0)

In [744]:
x

array([0., 0., 1., 0., 5., 3.])

In [745]:
extramb_plan = plans[['plan_name', 'usd_per_gb']]
extramb_plan.columns = ['plan', 'usd_per_gb']

In [746]:
mb_month = mb_month.merge(extramb_plan, on='plan', how='left')

In [747]:
mb_month['gb_cost'] = mb_month['extra_gb'] * mb_month['usd_per_gb']

In [748]:
mb_month = mb_month[['user_id', 'month', 'gb_cost']]

In [749]:
report = report.merge(mb_month, on=['user_id', 'month'], how='left')

In [750]:
report.sample(20)

,month,key,user_id,city,plan,reg_month,call_cost,msg_cost,gb_cost
155,2018-03-01,1,1061,"Columbia, SC MSA",ultimate,2018-03-01,NaN,NaN,NaN
2246,2018-10-01,1,1337,"Riverside-San Bernardino-Ontario, CA MSA",surf,2018-03-01,NaN,NaN,NaN
2294,2018-10-01,1,1388,"New York-Newark-Jersey City, NY-NJ-PA MSA",ultimate,2018-03-01,NaN,NaN,NaN
1253,2018-08-01,1,1032,"Birmingham-Hoover, AL MSA",ultimate,2018-06-01,NaN,NaN,NaN
2859,2018-12-01,1,1004,"Seattle-Tacoma-Bellevue, WA MSA",surf,2018-05-01,0.0,0.00,60.0
677,2018-06-01,1,1039,"Columbus, OH MSA",ultimate,2018-05-01,0.0,0.00,0.0
2573,2018-11-01,1,1199,"San Antonio-New Braunfels, TX MSA",ultimate,2018-08-01,0.0,0.00,0.0
3092,2018-12-01,1,1237,"New York-Newark-Jersey City, NY-NJ-PA MSA",ultimate,2018-08-01,0.0,0.00,0.0
1151,2018-07-01,1,1366,"Cincinnati, OH-KY-IN MSA",surf,2018-07-01,NaN,NaN,NaN
798,2018-06-01,1,1259,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD MSA",surf,2018-03-01,0.0,0.00,0.0
2033,2018-10-01,1,1080,"New York-Newark-Jersey City, NY-NJ-PA MSA",surf,2018-08-01,NaN,0.27,140.0
2932,2018-12-01,1,1077,"Charlotte-Concord-Gastonia, NC-SC MSA",ultimate,2018-01-01,0.0,0.00,0.0
2207,2018-10-01,1,1290,"New York-Newark-Jersey City, NY-NJ-PA MSA",surf,2018-09-01,NaN,NaN,NaN
944,2018-07-01,1,1031,"New York-Newark-Jersey City, NY-NJ-PA MSA",ultimate,2018-07-01,0.0,0.00,0.0
1436,2018-08-01,1,1287,"SacramentoRosevilleFolsom, CA MSA",surf,2018-03-01,NaN,NaN,NaN
934,2018-07-01,1,1011,"Cleveland-Elyria, OH MSA",ultimate,2018-01-01,0.0,0.00,0.0
1543,2018-08-01,1,1441,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,2018-03-01,NaN,NaN,NaN
1100,2018-07-01,1,1279,"Baton Rouge, LA MSA",ultimate,2018-02-01,NaN,NaN,NaN
2513,2018-11-01,1,1134,"Chicago-Naperville-Elgin, IL-IN-WI MSA",surf,2018-09-01,0.0,0.00,80.0
1610,2018-09-01,1,1039,"Columbus, OH MSA",ultimate,2018-05-01,0.0,0.00,0.0

### Profit

In [751]:
report.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3355 entries, 0 to 3354
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   month      3355 non-null   datetime64[ns]
 1   key        3355 non-null   int64
 2   user_id    3355 non-null   int64
 3   city       3355 non-null   object
 4   plan       3355 non-null   object
 5   reg_month  3355 non-null   datetime64[ns]
 6   call_cost  2258 non-null   float64
 7   msg_cost   1806 non-null   float64
 8   gb_cost    2277 non-null   float64
dtypes: datetime64[ns](2), float64(3), int64(2), object(2)
memory usage: 262.1+ KB

In [752]:
#fill in NaN values with 0
report.fillna(value=0, inplace=True)

In [753]:
report['total_cost'] = report['call_cost'] + report['msg_cost'] + report['gb_cost']

In [754]:
plan_charge = plans[['plan_name', 'usd_monthly_pay']]

In [755]:
plan_charge.columns = ['plan', 'monthly_pay']

In [756]:
report = report.merge(plan_charge, on='plan', how='left')

In [757]:
report['profit'] = report['total_cost'] + report['monthly_pay']

In [758]:
report.head()

,month,key,user_id,city,plan,reg_month,call_cost,msg_cost,gb_cost,total_cost,monthly_pay,profit
0,2018-01-01,1,1003,"Tulsa, OK MSA",surf,2018-01-01,0.0,0.0,0.0,0.0,20,20.0
1,2018-01-01,1,1011,"Cleveland-Elyria, OH MSA",ultimate,2018-01-01,0.0,0.0,0.0,0.0,70,70.0
2,2018-01-01,1,1019,"Jacksonville, FL MSA",surf,2018-01-01,0.0,0.0,0.0,0.0,20,20.0
3,2018-01-01,1,1029,"Tampa-St. Petersburg-Clearwater, FL MSA",surf,2018-01-01,0.0,0.0,0.0,0.0,20,20.0
4,2018-01-01,1,1042,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD MSA",surf,2018-01-01,0.0,0.0,0.0,0.0,20,20.0

### Data Analysis

#### Describe the customers behavior.

1. Find the minutes, texts and data users of each plan require every month.
2. Calculate:
    - mean, dispersion and standard deviation
3. Plot histograms.
    - describe the distributions

In [759]:
#create a df with for each user, each month: minutes, txts, data
#slice: surf and ultimate
#find totals of the resources in each slice in each month
    #groupby month, then find totals in each month

In [760]:
calls_month.head()

   user_id      month  call_cost
0     1000 2018-12-01        0.0
1     1001 2018-08-01        0.0
2     1001 2018-09-01        0.0
3     1001 2018-10-01        0.0
4     1001 2018-11-01        0.0

In [761]:
c = data_calls.groupby(['user_id', 'month'])[['duration']].agg(['sum']).reset_index()
c.columns = ['user_id', 'month', 'total_minutes']

In [762]:
t = data_messages.groupby(['user_id', 'month'])[['msg_count']].agg(['sum']).reset_index()
t.columns = ['user_id', 'month', 'total_msg']

In [763]:
d = data_internet.groupby(['user_id', 'month'])[['mb_used']].agg(['sum']).reset_index()
d.columns=['user_id', 'month', 'total_data']

In [764]:
r = months.merge(users, on='key')

In [765]:
r = r[['user_id','month', 'city', 'plan']]

In [766]:
r = r.merge(c, on=['user_id', 'month'], how='left')

In [767]:
r = r.merge(t,on=['user_id', 'month'], how='left' )

In [768]:
r = r.merge(d, on=['user_id', 'month'], how='left')

In [769]:
r.fillna(value=0, inplace=True)

In [770]:
r.head()

,user_id,month,city,plan,total_minutes,total_msg,total_data
0,1000,2018-01-01,"Atlanta-Sandy Springs-Roswell, GA MSA",ultimate,0.0,0.0,0.0
1,1001,2018-01-01,"Seattle-Tacoma-Bellevue, WA MSA",surf,0.0,0.0,0.0
2,1002,2018-01-01,"Las Vegas-Henderson-Paradise, NV MSA",surf,0.0,0.0,0.0
3,1003,2018-01-01,"Tulsa, OK MSA",surf,0.0,0.0,0.0
4,1004,2018-01-01,"Seattle-Tacoma-Bellevue, WA MSA",surf,0.0,0.0,0.0

In [771]:
r_surf = r.query('plan == "surf"')

In [772]:
r_ultimate = r.query('plan == "ultimate"')

In [773]:
r_surf

,user_id,month,city,plan,total_minutes,total_msg,total_data
1,1001,2018-01-01,"Seattle-Tacoma-Bellevue, WA MSA",surf,0.00,0.0,0.00
2,1002,2018-01-01,"Las Vegas-Henderson-Paradise, NV MSA",surf,0.00,0.0,0.00
3,1003,2018-01-01,"Tulsa, OK MSA",surf,0.00,0.0,0.00
4,1004,2018-01-01,"Seattle-Tacoma-Bellevue, WA MSA",surf,0.00,0.0,0.00
5,1005,2018-01-01,"Dallas-Fort Worth-Arlington, TX MSA",surf,0.00,0.0,0.00
...,...,...,...,...,...,...,...
5994,1494,2018-12-01,"New York-Newark-Jersey City, NY-NJ-PA MSA",surf,396.19,33.0,15302.45
5995,1495,2018-12-01,"New York-Newark-Jersey City, NY-NJ-PA MSA",surf,467.47,0.0,24097.40
5996,1496,2018-12-01,"New Orleans-Metairie, LA MSA",surf,278.61,11.0,16438.99
5998,1498,2018-12-01,"New York-Newark-Jersey City, NY-NJ-PA MSA",surf,324.77,0.0,23137.69
5999,1499,2018-12-01,"Orlando-Kissimmee-Sanford, FL MSA",surf,468.10,0.0,22059.21

In [774]:
r_surf_monthly = (r_surf
                  .pivot_table(index='month', values=['total_minutes', 'total_msg', 'total_data'], aggfunc=['sum', 'mean'])
                 )

In [775]:
r_surf_monthly.columns = ['total_data', 'total_minutes', 'total_msg', 'mean_data', 'mean_minutes', 'mean_msg']

In [776]:
r_surf_monthly

,total_data,total_minutes,total_msg,mean_data,mean_minutes,mean_msg
month,,,,,,
2018-01-01,9749.72,385.68,21.0,28.760236,1.137699,0.061947
2018-02-01,109609.59,2527.66,108.0,323.332124,7.456224,0.318584
2018-03-01,306945.12,7152.31,351.0,905.442832,21.098260,1.035398
2018-04-01,599210.15,16619.00,870.0,1767.581563,49.023599,2.566372
2018-05-01,1073099.33,29033.10,1849.0,3165.484749,85.643363,5.454277
2018-06-01,1484248.33,39499.26,2454.0,4378.313658,116.516991,7.238938
2018-07-01,2030815.67,51367.31,3271.0,5990.606696,151.525988,9.648968
2018-08-01,2720843.68,62721.48,4662.0,8026.087552,185.019115,13.752212
2018-09-01,3218737.67,75852.46,5968.0,9494.801386,223.753569,17.604720
2018-10-01,4102786.41,96149.09,8020.0,12102.614779,283.625634,23.657817
2018-11-01,4624009.00,113086.75,9165.0,13640.144543,333.589233,27.035398
2018-12-01,5766125.26,142297.14,12275.0,17009.219056,419.755575,36.209440

In [777]:
r_ultimate_monthly = (r_ultimate
                      .pivot_table(index='month', values=['total_minutes', 'total_msg', 'total_data'], aggfunc=['sum', 'mean'])
                     )

In [778]:
r_ultimate_monthly.columns = ['total_data', 'total_minutes', 'total_msg', 'mean_data', 'mean_minutes', 'mean_msg']

In [793]:
r_ultimate_monthly

,total_data,total_minutes,total_msg,mean_data,mean_minutes,mean_msg,msg_var,data_var,mins_var,msg_std,data_std,mins_std
month,,,,,,,,,,,,
2018-01-01,27672.37,732.65,62.0,171.878075,4.550621,0.385093,11.738276,1.474174e+06,1098.963143,3.426117,1214.155770,33.150613
2018-02-01,119901.66,2659.03,151.0,744.730807,16.515714,0.937888,37.408618,1.368983e+07,8608.680530,6.116258,3699.976942,92.782975
2018-03-01,219858.22,3428.42,243.0,1365.579006,21.294534,1.509317,73.451475,3.294771e+07,9396.948694,8.570384,5740.009504,96.937860
2018-04-01,338554.75,6646.67,463.0,2102.824534,41.283665,2.875776,123.496972,4.071696e+07,15315.503227,11.112919,6380.984301,123.755821
2018-05-01,482109.99,11126.28,931.0,2994.471988,69.107329,5.782609,380.183696,5.100805e+07,28749.949435,19.498300,7141.991772,169.558100
2018-06-01,720882.29,16441.12,1379.0,4477.529752,102.118758,8.565217,425.622283,6.963583e+07,36355.084442,20.630615,8344.808347,190.670093
2018-07-01,964339.92,23822.27,1937.0,5989.688944,147.964410,12.031056,599.980280,8.721317e+07,61592.387467,24.494495,9338.799299,248.178137
2018-08-01,1264845.13,28206.51,2732.0,7856.180932,175.195714,16.968944,890.692780,1.051707e+08,60010.555587,29.844477,10255.274766,244.970520
2018-09-01,1459408.78,35542.71,3259.0,9064.650807,220.762174,20.242236,917.872205,9.831727e+07,69858.741263,30.296406,9915.506754,264.308042
2018-10-01,1866930.66,45067.81,4181.0,11595.842609,279.924286,25.968944,1153.455280,1.076080e+08,72654.970580,33.962557,10373.429372,269.545860
2018-11-01,2163278.04,53400.65,4903.0,13436.509565,331.681056,30.453416,1220.561879,9.398728e+07,72370.001340,34.936541,9694.703963,269.016731
2018-12-01,2766801.97,65384.90,6796.0,17185.105404,406.117391,42.211180,1571.317624,7.769409e+07,63286.231446,39.639849,8814.425326,251.567548

In [780]:
#slice:surf and ultimate for every month
#mean = .mean() of minutes, text, data
#dispersion = 
#standard deviation = .std() of ""

In [781]:
x = r_surf.groupby('month')[['month','total_msg', 'total_data', 'total_minutes']].var()

In [782]:
x.columns = ['msg_var', 'data_var', 'mins_var']

In [783]:
y = r_ultimate.groupby('month')[['month','total_msg', 'total_data', 'total_minutes']].var()

In [784]:
y.columns = ['msg_var', 'data_var', 'mins_var']

In [785]:
r_surf_monthly = r_surf_monthly.merge(x, on='month', how='left')

In [786]:
r_ultimate_monthly = r_ultimate_monthly.merge(y, on='month', how='left')

In [787]:
a = r_surf.groupby('month')[['month','total_msg', 'total_data', 'total_minutes']].std()

In [788]:
a.columns = ['msg_std', 'data_std', 'mins_std']

In [789]:
b = r_ultimate.groupby('month')[['month','total_msg', 'total_data', 'total_minutes']].std()

In [790]:
b.columns = ['msg_std', 'data_std', 'mins_std']

In [791]:
r_surf_monthly = r_surf_monthly.merge(a, on='month', how='left')

In [792]:
r_ultimate_monthly = r_ultimate_monthly.merge(b, on='month', how='left')